# TimeZone Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
City..::..TimeZone Property
City Class See Also
---
Time-zone in which the city resides
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double TimeZone { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TimeZone As Double
	Get
```

Visual C++
---
```text
public:
property double TimeZone {
	double get ();
}
```

# Remarks
A read only property that returns the time zone in which the city resides. The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.
# See Also
City Class
Autodesk.Revit.DB Namespace